---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDidNotMatchRequestedTypeWarn
source: html/738963de-1906-e6ef-ec1a-1b306c5de219.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDidNotMatchRequestedTypeWarn Property

Assembly was changed to a new type, but did not match the type. Geometry could have been changed due to a join condition.

## Syntax (C#)
```csharp
public static FailureDefinitionId AssemblyDidNotMatchRequestedTypeWarn { get; }
```